#!/usr/bin/env python
# coding: utf-8

# <b>문제6 - 밭의 비밀

# In[1]:


import numpy as np

첫번째밭 = [
    [1,0,0,0,0],
    [0,0,1,0,1],
    [0,0,1,0,1],
    [0,0,1,0,1],
    [0,0,1,0,1]
]

두번째밭 = [
    [0,0,0,0,1],
    [0,0,0,0,3],
    [0,0,0,0,4],
    [0,2,0,0,2],
    [4,5,0,2,0]
]


# In[3]:


np.rot90(두번째밭, 1) + np.array(첫번째밭)


# In[5]:


np.rot90(두번째밭, 1) - np.array(첫번째밭)


# In[7]:


np.rot90(두번째밭, 1) * np.array(첫번째밭)


# In[10]:


np.array(첫번째밭) @ np.rot90(두번째밭, 1)


# In[14]:


정답 = np.rot90(두번째밭, 1) + np.array(첫번째밭)
''.join([str(i) for i in 정답[0]])


# In[17]:


int(''.join([str(i) for i in 정답[0]]),8)


# In[19]:


chr(int(''.join([str(i) for i in 정답[1]]),8))


# In[22]:


for k in range(5):
    print(chr(int(''.join([str(i) for i in 정답[k]]),8)))


# In[ ]:





# In[28]:


sample = [
    [0,0,0,0,0],
    [0,0,0,0,0],
    [0,0,0,0,0],
    [0,0,0,0,0],
    [0,0,0,0,0]
]


첫번째밭 = [
    [1,0,0,0,0],
    [0,0,1,0,1],
    [0,0,1,0,1],
    [0,0,1,0,1],
    [0,0,1,0,1]
]

두번째밭 = [
    [0,0,0,0,1],
    [0,0,0,0,3],
    [0,0,0,0,4],
    [0,2,0,0,2],
    [4,5,0,2,0]
]


# In[25]:


x = [[None] * 5] * 5
x


# In[27]:


x[0][0] = 1000
x


# In[29]:


두번째밭 = [
    [0,0,0,0,1],
    [0,0,0,0,3],
    [0,0,0,0,4],
    [0,2,0,0,2],
    [4,5,0,2,0]
]


# In[ ]:


0, 4 -> 0, 0
1, 4 -> 0, 1
2, 4 -> 0, 2
3, 4 -> 0, 3
4, 4 -> 0, 4

0, 3 -> 1, 0
1, 3 -> 1, 1
2, 3 -> 1, 2
3, 3 -> 1, 3
4, 3 -> 1, 4

0, 2 -> 2, 0
1, 2 -> 2, 1
2, 2 -> 2, 2
3, 2 -> 2, 3
4, 2 -> 2, 4

0, 1 -> 3, 0
1, 1 -> 3, 1
2, 1 -> 3, 2
3, 1 -> 3, 3
4, 1 -> 3, 4

0, 0 -> 4, 0
1, 0 -> 4, 1
2, 0 -> 4, 2
3, 0 -> 4, 3
4, 0 -> 4, 4


# In[33]:


for i in range(len(두번째밭)):
    for j in range(len(두번째밭[0])):
        sample[i][j] = 두번째밭[j][len(두번째밭)-1-i]
        
sample


# In[34]:


for i in range(len(두번째밭)):
    for j in range(len(두번째밭[0])):
        sample[i][j] += 첫번째밭[i][j]
        
sample

